Конфигурация/Documents/РегистрацияСтоимостиАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияСтоимостиАктивов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФинансовыеПоказатели</xr:Item>
				<xr:Item>InformationRegister.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельРасчетаСтоимостиОценки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СЧАРынок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СЧАБаланс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияСтоимости</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСтоимостиПереоценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеРезервовПИФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеСписаниеРезервов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АктивыНеОтносящиесяКЦеннымБумагам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СубъектАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБаланс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРынок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаСтроки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеСтоимостиАктивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
								<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРынокВВалютеУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньОценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/РегистрацияСтоимостиАктивов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.КорзинаЦенныхБумаг = Истина; // в этом документе всегда вкл. корзина ц/б
	
	ПриЧтенииСозданииНаСервере();
		
КонецПроцедуры                              

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПодтверждениеОперацииНаСервере();
	
	Если Не Объект.РегистрацияСтоимости.Пустая() Тогда
		ЗначениеВРеквизитФормы(Объект.РегистрацияСтоимости.ПолучитьОбъект(), "РегистрацияСтоимости");
	КонецЕсли; 	
	
	Если Не Объект.НачислениеРезервовПИФ.Пустая() Тогда
		ЗначениеВРеквизитФормы(Объект.НачислениеРезервовПИФ.ПолучитьОбъект(), "НачислениеРезервовПИФ");
	КонецЕсли;
	
	Если Не Объект.НачислениеСписаниеРезервов.Пустая() Тогда
		ЗначениеВРеквизитФормы(Объект.НачислениеСписаниеРезервов.ПолучитьОбъект(), "НачислениеСписаниеРезервов");
	КонецЕсли;
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьРегистрациюСтоимости(Отказ, ТекущийОбъект);
	ЗаполнитьНачислениеСписаниеРезервов(Отказ, ТекущийОбъект);
	
	Если ЭтаФорма.ЭтоПИФ Тогда
		ЗаполнитьНачислениеРезервов(Отказ, ТекущийОбъект);
	ИначеЕсли Не Объект.НачислениеРезервовПИФ.Пустая() Тогда 
		НачислениеРезервовОбъект = РеквизитФормыВЗначение("НачислениеРезервовПИФ");
		НачислениеРезервовОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрациюСтоимости(Отказ, ТекущийОбъект)

	РегистрацияСтоимостиОбъект = РеквизитФормыВЗначение("РегистрацияСтоимости");
	
	ЗаполнитьЗначенияСвойств(РегистрацияСтоимостиОбъект, Объект, "Дата, Организация, СчетДоверительногоУправления, ПометкаУдаления");
	РегистрацияСтоимостиОбъект.ЦельРасчета		= Объект.ЦельРасчетаСтоимостиОценки;
	РегистрацияСтоимостиОбъект.ВидУчета			= ЭтаФорма.ВидУчета;
	РегистрацияСтоимостиОбъект.Ответственный 	= РаботаСПользователями.ТекущийПользователь();
		
	ТекущийОбъект.ДополнительныеСвойства.Вставить("РегистрацияСтоимости", РегистрацияСтоимостиОбъект);
	
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьНачислениеРезервов(Отказ, ТекущийОбъект)

	НачислениеРезервовОбъект = РеквизитФормыВЗначение("НачислениеРезервовПИФ");
	
	ЗаполнитьЗначенияСвойств(НачислениеРезервовОбъект, Объект, "Дата, Организация, СчетДоверительногоУправления, ПометкаУдаления");
	НачислениеРезервовОбъект.ПаевойИнвестиционныйФонд 	= Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
	НачислениеРезервовОбъект.Ответственный 				= РаботаСПользователями.ТекущийПользователь();
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НачислениеРезервовПИФ", НачислениеРезервовОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачислениеСписаниеРезервов(Отказ, ТекущийОбъект)

	НачислениеСписаниеРезервовОбъект = РеквизитФормыВЗначение("НачислениеСписаниеРезервов");
	
	ЗаполнитьЗначенияСвойств(НачислениеСписаниеРезервовОбъект, Объект, "Дата, Организация, СчетДоверительногоУправления, ПометкаУдаления");
	НачислениеСписаниеРезервовОбъект.ЦельРасчета = Объект.ЦельРасчетаСтоимостиОценки;
	НачислениеСписаниеРезервовОбъект.Ответственный = РаботаСПользователями.ТекущийПользователь();
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НачислениеСписаниеРезервов", НачислениеСписаниеРезервовОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьИтогиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьРежимОтображенияТаблицыЦенныхБумаг();
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

#Область Элементы_шапки

&НаКлиенте
Процедура РучнойВводПриИзменении(Элемент)
	
	Если Объект.РучнойВвод Тогда
		// разрешаем редактирование
		НастроитьВидимостьИДоступность(ЭтаФорма);
	Иначе
		// спросим о перезаполнении, в случае отказа вернем ружной ввод
		ТекстВопроса = "Документ будет перезаполнен, все внесенные изменения будут утеряны. Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("РучнойВводПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Внимание!"); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РучнойВводПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		// запрещаем редактирование
		НастроитьВидимостьИДоступность(ЭтаФорма);
		// заполняем
		ЗаполнитьАдресФайлаXML();
		ЗаполнитьНаСервере();
	Иначе
		Объект.РучнойВвод = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьПриИзмененииРеквизитовШапки();
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ЗаполнитьПриИзмененииРеквизитовШапки();
	
	ОбновитьВидимостьПоказателейПИФ();
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеРезервовСуммаНаВознаграждениеУправляющегоПриИзменении(Элемент)
	ЗаполнитьИтогиНаСервере(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НачислениеРезервовСуммаНаУслугиДепозитарияПриИзменении(Элемент)
	ЗаполнитьИтогиНаСервере(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НачислениеРезервовСуммаНаПрочиеРасходыПриИзменении(Элемент)
	ЗаполнитьИтогиНаСервере(Истина, Ложь);
КонецПроцедуры

#КонецОбласти

#Область Стоимость_переоценки

&НаКлиенте
Процедура СтоимостиПереоценкиПриИзменении(Элемент)
	ЗаполнитьИтогиНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборСтрокиТаблицы(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиРынокПриИзменении(Элемент)
	ПриИзмененииРынка("СтоимостиПереоценки");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиЦеннаяБумагаПриИзменении(Элемент)
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере("СтоимостиПереоценки", Элементы.СтоимостиПереоценки.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиКоличествоПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "Количество");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиЦенаКотировкиПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "ЦенаКотировки");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиВалютаКотировкиПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "ВалютаКотировки");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиЦенаКотировкиКупонаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "ЦенаКотировкиКупона");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиВалютаКотировкиКупонаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "ВалютаКотировкиКупона");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиЦенаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиЦенаКупонаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "ЦенаКупона");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиСуммаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиСуммаКупонаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "СуммаКупона");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиКурсВалютыНоминалаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "КурсВалютыНоминала");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиСуммаВВалютеУчетаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "СуммаВВалютеУчета");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиСуммаКупонаВВалютеУчетаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "СуммаКупонаВВалютеУчета");
КонецПроцедуры

#КонецОбласти

#Область Активы_не_относящиеся_к_ценным_бумагам

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборСтрокиТаблицы("АктивыНеОтносящиесяКЦеннымБумагам");
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = ТипЗнч(Элементы.АктивыНеОтносящиесяКЦеннымБумагам.ТекущиеДанные.ВидЗадолженности) = Тип("СправочникСсылка.Резервы");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = (НЕ Элемент.ТекущийЭлемент = Элементы.АктивыНеОтносящиесяКЦеннымБумагамУровеньОценки
			И ТипЗнч(Элементы.АктивыНеОтносящиесяКЦеннымБумагам.ТекущиеДанные.ВидЗадолженности) = Тип("СправочникСсылка.Резервы"));
			
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамПередУдалением(Элемент, Отказ)
	Отказ = ТипЗнч(Элементы.АктивыНеОтносящиесяКЦеннымБумагам.ТекущиеДанные.ВидЗадолженности) = Тип("СправочникСсылка.Резервы");
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования 
		И НЕ ТипЗнч(Элемент.ТекущиеДанные.ВидЗадолженности) = Тип("СправочникСсылка.Резервы") Тогда
		ЗаполнитьИтогиНаСервере(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ НоваяСтрока 
		И Не ОтменаРедактирования
		И НЕ Элемент.ТекущийЭлемент = Элементы.АктивыНеОтносящиесяКЦеннымБумагамУровеньОценки	
		И ТипЗнч(Элемент.ТекущиеДанные.ВидЗадолженности) = Тип("СправочникСсылка.Резервы")
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение задолженности по резервам запрещено.",,,, Отказ);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамПослеУдаления(Элемент)
	
	ЗаполнитьИтогиНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамСуммаРынокПриИзменении(Элемент)
	
	ПересчитатьСуммуВВалютеУчетаТекущейСтрокиАктивовНеОтносящихсяКЦеннымБумагам();	
	ЗаполнитьИтогиНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамСуммаРынокВВалютеУчетаПриИзменении(Элемент)
	
	ПересчитатьСуммуВВалютеАктиваТекущейСтрокиАктивовНеОтносящихсяКЦеннымБумагам();	
	ЗаполнитьИтогиНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамВалютаСтрокиПриИзменении(Элемент)
		
	ПересчитатьСуммуВВалютеУчетаТекущейСтрокиАктивовНеОтносящихсяКЦеннымБумагам();	
	ЗаполнитьИтогиНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивыНеОтносящиесяКЦеннымБумагамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		Элементы.АктивыНеОтносящиесяКЦеннымБумагам.ТекущиеДанные.ВалютаСтроки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета");		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочие_ценные_бумаги

&НаКлиенте
Процедура ПрочиеЦенныеБумагиПриИзменении(Элемент)
	ЗаполнитьИтогиНаСервере(Истина);
КонецПроцедуры
	
&НаКлиенте
Процедура ПрочиеЦенныеБумагиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборСтрокиТаблицы(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеЦенныеБумагиРынокПриИзменении(Элемент)
	ПриИзмененииРынка("ПрочиеЦенныеБумаги");
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеЦенныеБумагиЦеннаяБумагаПриИзменении(Элемент)
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере("СтоимостиПрочихЦенныхБумаг", Элементы.ПрочиеЦенныеБумаги.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеЦенныеБумагиЦенаКотировкиПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "ЦенаКотировки");
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеЦенныеБумагиВалютаКотировкиПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "ВалютаКотировки");
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеЦенныеБумагиЦенаКотировкиКупонаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "ЦенаКотировкиКупона");
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеЦенныеБумагиВалютаКотировкиКупонаПриИзменении(Элемент)
	ПересчетТабличнойЧасти(Элемент, "ВалютаКотировкиКупона");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КОМАНДЫ_ФОРМЫ

&НаКлиенте
Процедура КомандаПечатьИВыгрузка(Команда)
	
	Если Не Объект.Проведен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для печати и выгрузки документ необходимо провести!");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ был изменен! Для печати и выгрузки его необходимо записать!");
		Возврат;
	КонецЕсли;	
		
	ФормаОбработки = ПолучитьФорму("Обработка.ПечатьИВыгрузка_СЧА_РСА.Форма.Форма", , ЭтаФорма);
	ОбъектОбработки  = ФормаОбработки.Объект;
	СписокДокументов = ФормаОбработки.СписокСсылок;
	СписокДокументов.Очистить();
	НоваяСтрока = СписокДокументов.Добавить();
	НоваяСтрока.Значение = Объект.Ссылка;
	НоваяСтрока.СчетДУ = Объект.СчетДоверительногоУправления;
	НоваяСтрока.Флажок = Истина;
	
	ФормаОбработки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИтоги(Команда)
	
	ЗаполнитьИтогиНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьДокумента(Команда)
	
	ОтчетОСостоянииПортфеля = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОтчетОСостоянииПортфеля");
	Если ОтчетОСостоянииПортфеля = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(ОтчетОСостоянииПортфеля);
	СтруктураДействий = Новый Структура;
			
	СтруктураДействий.Вставить("ВыгрузитьФайл", 		Ложь);
	СтруктураДействий.Вставить("ОтправитьФайл", 		Ложь);
	СтруктураДействий.Вставить("Перезаполнить", 		Ложь);
	СтруктураДействий.Вставить("ОткрытьФорму", 			Истина);
	СтруктураДействий.Вставить("ОткрытьИПерезаполнить", Ложь);
		
	НастройкиОтчета = Новый Структура;
	
	НастройкиОтчета.Вставить("АвтоматическоеФормирование", 		Истина);
	НастройкиОтчета.Вставить("СтруктураДействий", 				СтруктураДействий);
	НастройкиОтчета.Вставить("Организация", 					Объект.Организация);
	НастройкиОтчета.Вставить("КлючТекущегоВарианта",			"ПечатнаяФормаРСА");
	НастройкиОтчета.Вставить("СчетДоверительногоУправления",	Объект.СчетДоверительногоУправления);
		
	ФормаОтчета = ПолучитьФорму("ВнешнийОтчет." + ИмяПодключенногоОбъекта + ".Форма", );
	
	// Пока используем сохраненное значение
	Подписант = ФормаОтчета.Подписант;
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
    СтруктураКлюча.Вставить("Язык", 			ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", 			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо"));
	СтруктураКлюча.Вставить("КонтактноеЛицо",	Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	Если СтруктураДанныхКонтактногоЛица.Количество() = 0 Тогда
		СтруктураДанныхКонтактногоЛица.Вставить("Подразделение",		ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
    	СтруктураДанныхКонтактногоЛица.Вставить("Язык", 				ПредопределенноеЗначение("Справочник.Языки.Русский"));
		СтруктураДанныхКонтактногоЛица.Вставить("Объект", 				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо"));
		СтруктураДанныхКонтактногоЛица.Вставить("КонтактноеЛицо",		ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка"));
		СтруктураДанныхКонтактногоЛица.Вставить("Должность",			"");
		СтруктураДанныхКонтактногоЛица.Вставить("ОснованиеПолномочий",	"");
	КонецЕсли;		
	
	НастройкиОтчета.Вставить("Подписант", СтруктураДанныхКонтактногоЛица);
		
	Период = Новый СтандартныйПериод(Объект.Дата, Объект.Дата);
	НастройкиОтчета.Вставить("Период", Период);
	
	ДополнительныеПараметры = Новый Структура;
	
	ДополнительныеПараметры.Вставить("НастройкиОтчета", НастройкиОтчета);

	ФормаОтчета = ПолучитьФорму("ВнешнийОтчет." + ИмяПодключенногоОбъекта + ".Форма", ДополнительныеПараметры);	
	
	ФормаОтчета.АвтоматическоеФормирование();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифроватьРасчетСтоимостиЦБ(Команда)

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЦенныеБумаги Тогда
		ИмяЭлемента = "СтоимостиПереоценки" + ?(ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг, "", "Краткий");
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПрочиеЦенныеБумаги Тогда
		ИмяЭлемента = "ПрочиеЦенныеБумаги";
	Иначе
		Возврат;
	КонецЕсли; 	
	
	ТекущиеДанные = Элементы[ИмяЭлемента].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ Не ЗначениеЗаполнено(ТекущиеДанные.ЦеннаяБумага) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для расшифровки", , , "Объект.СтоимостиПереоценки");
		Возврат;
	КонецЕсли;
	
	// Проверяем, что заведены настройки оценки, и подгружаем файл с оценочной стоимостью, предоставленной клиентом
	
	Отказ						= Ложь;
	НастройкиОценки				= РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ЦельРасчетаСтоимостиОценки);
	ВыполнятьРасчетПоУказаниюЦБ	= НастройкиОценки.ВыполнятьРасчетПоУказаниюЦБ5419 ИЛИ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316;
	АдресТаблицыСтоимостей		= Неопределено;
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + Объект.ЦельРасчетаСтоимостиОценки + "'", , , , Отказ);
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом") Тогда
		АдресТаблицыСтоимостей = РаботаСВнешнимиСистемамиКлиентСервер.ПоместитьФайлОценочнойСтоимостиПредоставленнойКлиентомВоВременноеХранилище(
			Объект.СчетДоверительногоУправления, Объект.Дата, Ложь, ЭтаФорма.УникальныйИдентификатор, Отказ);
		Отказ = Отказ И Не ВыполнятьРасчетПоУказаниюЦБ; // Если оценка "заморожена", то актуальные цены от клиента не нужны
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Формируем расшифровку расчета
	
	Ошибки				= Неопределено;
	РасшифровкаРасчета	= Неопределено;
	
	ПараметрыПереоценки	= Новый Структура("Организация, СчетДоверительногоУправления, Дата");
	ЗаполнитьЗначенияСвойств(ПараметрыПереоценки, Объект);
	ПараметрыПереоценки.Вставить("ЦельРасчета",				Объект.ЦельРасчетаСтоимостиОценки);
	ПараметрыПереоценки.Вставить("ВидУчета",				ЭтаФорма.ВидУчета);
	ПараметрыПереоценки.Вставить("ОценкаПрочихЦенныхБумаг",	ИмяЭлемента = "ПрочиеЦенныеБумаги");
	
	Если РаботаСДокументами.СформироватьРасшифровкуРасчетаСтоимостиЦеннойБумаги(РасшифровкаРасчета, ПараметрыПереоценки, ТекущиеДанные.ЦеннаяБумага, НастройкиОценки.ВариантРасчетаОценочнойСтоимости, АдресТаблицыСтоимостей, Ошибки) Тогда
		РасшифровкаРасчета.Показать("Расчет стоимости '" + Строка(ТекущиеДанные.ЦеннаяБумага) + "'");		
	ИначеЕсли Ошибки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета стоимости для варианта '" + НастройкиОценки.ВариантРасчетаОценочнойСтоимости + "' не реализована");	
	Иначе
		ТекстОшибки = "Ошибка получения расшифровки расчета:" + Символы.ПС + СтрСоединить(Ошибки, Символы.ПС);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если ЗаполнитьАдресФайлаXML() Тогда
	
		Если ДокументСодержитДанные() Тогда
			
			Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемЗавершение", ЭтаФорма);
			
			ТекстВопроса = СтрШаблон("Документ будет перезаполнен%1. Продолжить?", ?(Объект.РучнойВвод, ", все внесенные изменения будут утеряны", ""));
			
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Внимание!");
			
		Иначе
			ЗаполнитьНаСервере();
		КонецЕсли;		
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьРасчетРезервов(Команда)
	
	РасшифровкаРасчета = Неопределено;
	КомандаПоказатьРасчетРезервовНаСервере(РасшифровкаРасчета);
	
	Если ТипЗнч(РасшифровкаРасчета) = Тип("ТабличныйДокумент") Тогда
		РасшифровкаРасчета.Показать("Расшифровка расчета резервов");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить расшифровку расчета");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьРезервы(Команда)
	РассчитатьРезервыПИФНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаКонтрольСЧА(Команда)
	
	Если Не ЭтаФорма.Объект.Ссылка.Пустая() 
		И ЭтаФорма.Объект.ВерсияДанных <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Объект.Ссылка, "ВерсияДанных") Тогда
		Предупреждение("Документ был изменен другим пользователем, перед контролем СЧА данные будут перечитаны");
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
	РезультатКонтроля = КонтрольСЧАНаСервере();	
	Если ТипЗнч(РезультатКонтроля) = Тип("ТабличныйДокумент") Тогда
		Если РезультатКонтроля.ВысотаТаблицы = 0 Тогда
			ПоказатьПредупреждение(, "Расхождений не обнаружено",, "Контроль СЧА");
		Иначе
			РезультатКонтроля.ТолькоПросмотр = Истина;
			РезультатКонтроля.ОтображатьСетку = Ложь;
			РезультатКонтроля.Показать("Контроль СЧА " + Объект.СчетДоверительногоУправления + " за " + Формат(Объект.Дата, "ДФ='dd.MM.yyyy'"));
		КонецЕсли; 
	Иначе
		ОписаниеОшибки = "";
		Если ТипЗнч(РезультатКонтроля) = Тип("Строка") И ЗначениеЗаполнено(РезультатКонтроля) Тогда
			ОписаниеОшибки = ". Система сообщает:" + Символы.ПС + РезультатКонтроля;
		КонецЕсли; 
		ПоказатьПредупреждение(, "Не удалось выполнить контроль" + ОписаниеОшибки
		,, "Контроль СЧА");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗадатьВалютуКотировки(Команда)	
	
	ЗадатьВалютуКотировки("ВалютаКотировки", "Валюта котировки");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗадатьВалютуКотировкиКупона(Команда)
	
	ЗадатьВалютуКотировки("ВалютаКотировкиКупона", "Валюта котировки купона");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВалютуКотировки(Поле, ПредставлениеПоля)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЦенныеБумаги Тогда
		ИмяКорзины = "СтоимостиПереоценки" + ?(ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг, "", "Краткий");
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПрочиеЦенныеБумаги Тогда
		ИмяКорзины = "ПрочиеЦенныеБумаги";
	КонецЕсли; 	
	
	ТекущиеДанные	= Элементы[ИмяКорзины].ТекущиеДанные;
	ТекущееЗначение	= ТекущиеДанные[Поле];
	
	Если Не ВвестиЗначение(ТекущееЗначение, ПредставлениеПоля, Тип("СправочникСсылка.Валюты")) Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные[Поле] = ТекущееЗначение;
	
	ПересчетТабличнойЧасти(Элементы[ИмяКорзины], Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПереключитьРежимОтображения(Команда)
	
	ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг = (Команда.Имя = "КомандаРежимОтображенияПолный");
	
	УстановитьРежимОтображенияТаблицыЦенныхБумаг();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифровкаСтоимостиАктиваПоРыночнойСтавке(Команда)
	
	ТекущиеДанные = Элементы.АктивыНеОтносящиесяКЦеннымБумагам.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ТипЗнч(ТекущиеДанные.СубъектАналитики) = Тип("СправочникСсылка.ДепозитныеВклады")
			ИЛИ ТипЗнч(ТекущиеДанные.СубъектАналитики) = Тип("СправочникСсылка.Займы")
			ИЛИ ТипЗнч(ТекущиеДанные.СубъектАналитики) = Тип("ДокументСсылка.МНО")
		Тогда
			Актив = ТекущиеДанные.СубъектАналитики;
		ИначеЕсли ТипЗнч(ТекущиеДанные.Основание) = Тип("ДокументСсылка.Сделка")
			ИЛИ ТипЗнч(ТекущиеДанные.Основание) = Тип("ДокументСсылка.СделкаРЕПО") 
			ИЛИ ТипЗнч(ТекущиеДанные.Основание) = Тип("ДокументСсылка.СделкаСНедвижимостью")
		Тогда
			Актив = ТекущиеДанные.Основание;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для данного актива расшфировка не предусмотрена");
			Возврат;
		КонецЕсли;
		
		Отказ = Ложь;
		
		Результат = РаботаСоСтоимостьюПоРыночнойСтавке.РасшифровкаСтоимостиАктиваПоРыночнойСтавке(
			Актив, Объект.СчетДоверительногоУправления, Объект.Дата, Объект.ЦельРасчетаСтоимостиОценки, , Отказ);
		
		Если Отказ Тогда
			Предупреждение("Проверка на рыночность завершилась с ошибками. См. окно сообщений",, "Расшифровка стоимости активов");
		Иначе
			ИмяРасшифровки = РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(Строка(Актив) + " на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy"));
			Результат.Показать(ИмяРасшифровки);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьСкрытьКолонкуРезервы(Команда)
	
	Элементы.АктивыНеОтносящиесяКЦеннымБумагамКнопкаРезервы.Пометка =
		Не Элементы.АктивыНеОтносящиесяКЦеннымБумагамКнопкаРезервы.Пометка;
		
	Элементы.АктивыНеОтносящиесяКЦеннымБумагамСуммаРезерваВВалютеУчета.Видимость = Элементы.АктивыНеОтносящиесяКЦеннымБумагамКнопкаРезервы.Пометка;	
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьВалютуСтроки(Команда)
	
	Если Не Объект.РучнойВвод Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюту можно изменять только при ручном режиме заполнения документа");
		Возврат;
	КонецЕсли;
	
	ТекущиеДаные = Элементы.АктивыНеОтносящиесяКЦеннымБумагам.ТекущиеДанные;
	
	Если ТекущиеДаные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана строка для изменения валюты");
		Возврат;
	КонецЕсли;
	
	ТекущаяВалютаСтроки = ТекущиеДаные.ВалютаСтроки;
	
	ВыбранноеЗначение = ОткрытьФормуМодально("Справочник.Валюты.ФормаВыбора",, ЭтаФорма);
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ВыбранноеЗначение <> ТекущаяВалютаСтроки Тогда
		ТекущиеДаные.ВалютаСтроки = ВыбранноеЗначение;
		АктивыНеОтносящиесяКЦеннымБумагамВалютаСтрокиПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#Область Расшифровка_расчета_финансовых_показателей

&НаКлиенте
Процедура КомандаПоказатьРасчетФинансовыхПоказателей(Команда)
	
	Если НЕ Объект.Проведен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не проведён!");
		Возврат;
	КонецЕсли;
	
	ВидыФинансовыхПоказателей = РаботаСМетаданнымиПовтИсп.ЗначенияПредопределенныхЭлементовСправочникаВСтруктуру("ВидыФинансовыхПоказателей");
	
	МассивПоказателейДляКоторыхЕстьРасшифровка = Новый Массив;
	МассивПоказателейДляКоторыхЕстьРасшифровка.Добавить(ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода);
	МассивПоказателейДляКоторыхЕстьРасшифровка.Добавить(ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода);
	МассивПоказателейДляКоторыхЕстьРасшифровка.Добавить(ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущихТрехЛет);
	МассивПоказателейДляКоторыхЕстьРасшифровка.Добавить(ВидыФинансовыхПоказателей.ДоходностьПФРВесьПериод);
	МассивПоказателейДляКоторыхЕстьРасшифровка.Добавить(ВидыФинансовыхПоказателей.ДоходностьСтратегииСНачалаГода);
	
	СписокФинансовыхПоказателей = ПолучитьСписокФинансовыхПоказателей(Объект.Ссылка, МассивПоказателейДляКоторыхЕстьРасшифровка);
	
	Если СписокФинансовыхПоказателей.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет показателей, для которых доступна расшифровка", Объект.Ссылка);
		
	Иначе
	
		ВыбранноеЗначение = СписокФинансовыхПоказателей.ВыбратьЭлемент();
		Если ВыбранноеЗначение <> Неопределено Тогда
			Если (ВыбранноеЗначение.Значение = ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода) 
				ИЛИ (ВыбранноеЗначение.Значение = ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода) 
				ИЛИ (ВыбранноеЗначение.Значение = ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущихТрехЛет) 
				ИЛИ (ВыбранноеЗначение.Значение = ВидыФинансовыхПоказателей.ДоходностьПФРВесьПериод) Тогда  	
				
				ДатаРасчетаДоходностиПФР = ПолучитьДатуРасчетаДоходностиПФР(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Дата);
				Если ДатаРасчетаДоходностиПФР = Неопределено Тогда
					Возврат;
				ИначеЕсли ДатаРасчетаДоходностиПФР <> НачалоДня(Объект.Дата) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показатель " + ВыбранноеЗначение.Значение + " рассчитывается только на конец квартала (" + Формат(ДатаРасчетаДоходностиПФР, "ДФ=dd.MM.yy") + ")");
					Возврат;
				КонецЕсли;
				
				ДеталиРасчета = КомандаОтобразитьРасчетНаСервере(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Дата, ВыбранноеЗначение.Значение);
				ДеталиРасчета.Показать("Расчет доходности инвестирования " + Объект.СчетДоверительногоУправления + " на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy"));		
				
			ИначеЕсли ВыбранноеЗначение.Значение = ВидыФинансовыхПоказателей.ДоходностьСтратегииСНачалаГода Тогда

				ДеталиРасчета = КомандаОтобразитьРасчетНаСервере(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Дата, ВыбранноеЗначение.Значение);
				ДеталиРасчета.Показать("Расчет доходности стратегии с начала года по договору " + Объект.СчетДоверительногоУправления + " на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy"));		
				
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьДатуРасчетаДоходностиПФР(Организация, СчетДоверительногоУправления, Период)
	
	Отказ = Ложь;
	
	Возврат Документы.РегистрацияСтоимостиАктивов.ПолучитьДатуРасчетаДоходностиПФР(Организация, СчетДоверительногоУправления, Период, Отказ);
	
КонецФункции
	
&НаСервереБезКонтекста
Функция РасшифровкаПроверкиРасчетаИУчетныхДанных(ТабличныйДокумент, МакетРасшифровка, Расшифровка)
	
	ОбластьШапка	= МакетРасшифровка.ПолучитьОбласть("ШапкаПроверка");
	ОбластьСтрока	= МакетРасшифровка.ПолучитьОбласть("СтрокаПроверка");
	ОбластьСтрокаРасхождение	= МакетРасшифровка.ПолучитьОбласть("СтрокаПроверкаРасхождение");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	Для Каждого СтрокаРасшифровки Из Расшифровка.Таблица Цикл 
		Если СтрокаРасшифровки.ДоходностьУчет = СтрокаРасшифровки.ДоходностьРасчет Тогда 
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаРасшифровки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		Иначе	
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаРасхождение.Параметры, СтрокаРасшифровки);
			ТабличныйДокумент.Вывести(ОбластьСтрокаРасхождение);			
		КонецЕсли;
	КонецЦикла;	
	
КонецФункции	

&НаСервереБезКонтекста 
Функция КомандаОтобразитьРасчетНаСервере(Организация, СчетДоверительногоУправления, Дата, ВидФинансовогоПоказателя, НачалоПериода = Неопределено)

	Отказ = Ложь;
	ТабличныйДокумент = Новый ТабличныйДокумент;
		
	Если (ВидФинансовогоПоказателя = Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРТекущегоГода) 
			ИЛИ (ВидФинансовогоПоказателя = Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущегоГода) 
			ИЛИ (ВидФинансовогоПоказателя = Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРПредыдущихТрехЛет) 
			ИЛИ (ВидФинансовогоПоказателя = Справочники.ВидыФинансовыхПоказателей.ДоходностьПФРВесьПериод) Тогда  	
		//только для ПФР
		ДеталиРасчета = Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьИнвестированияПФР(Организация, СчетДоверительногоУправления, КонецКвартала(Дата), Истина);
		
		МакетРасшифровка = Документы.РегистрацияСтоимостиАктивов.ПолучитьМакет("РасшифровкаДоходностиИнвестированияПФР");
		
		Документы.РегистрацияСтоимостиАктивов.РасшифровкаСтрокФинПоказателей(ТабличныйДокумент, МакетРасшифровка, ДеталиРасчета.Расшифровка_Строка010, "010");
		Документы.РегистрацияСтоимостиАктивов.РасшифровкаСтрокФинПоказателей(ТабличныйДокумент, МакетРасшифровка, ДеталиРасчета.Расшифровка_Строка020, "020");
		Документы.РегистрацияСтоимостиАктивов.РасшифровкаСтрокФинПоказателей(ТабличныйДокумент, МакетРасшифровка, ДеталиРасчета.Расшифровка_Строка030, "030");
		Документы.РегистрацияСтоимостиАктивов.РасшифровкаСтрокФинПоказателей(ТабличныйДокумент, МакетРасшифровка, ДеталиРасчета.Расшифровка_Строка040, "040");
		
		РасшифровкаПроверкиРасчетаИУчетныхДанных(ТабличныйДокумент, МакетРасшифровка, ДеталиРасчета.Расшифровка_Проверка);
		
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ОтображатьСетку = Ложь;
		
	ИначеЕсли ВидФинансовогоПоказателя = Справочники.ВидыФинансовыхПоказателей.ДоходностьСтратегииСНачалаГода Тогда
		
		ДеталиРасчета = Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьСтратегииСНачалаГода(Организация, СчетДоверительногоУправления, Дата, Истина, Отказ);
		
		МакетРасшифровка = Документы.РегистрацияСтоимостиАктивов.ПолучитьМакет("РасшифровкаДоходностиСтратегииСНачалаГода");
		
		Документы.РегистрацияСтоимостиАктивов.РасшифровкаСтрокФинПоказателей(ТабличныйДокумент, МакетРасшифровка, ДеталиРасчета.Расшифровка, "");
		
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ОтображатьСетку = Ложь;
		
	КонецЕсли;	
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиенте
Функция ДокументСодержитДанные()

	Возврат Объект.АктивыНеОтносящиесяКЦеннымБумагам.Количество() > 0
		Или ЭтаФорма.РегистрацияСтоимости.СтоимостиПереоценки.Количество() > 0
		Или ЭтаФорма.РегистрацияСтоимости.СтоимостиПрочихЦенныхБумаг.Количество() > 0
		Или ЭтаФорма.НачислениеСписаниеРезервов.Партии.Количество() > 0
		Или ЭтаФорма.НачислениеРезервовПИФ.СуммаНаВознаграждениеУправляющего <> 0
		Или ЭтаФорма.НачислениеРезервовПИФ.СуммаНаПрочиеРасходы <> 0
		Или ЭтаФорма.НачислениеРезервовПИФ.СуммаНаУслугиДепозитария <> 0;

КонецФункции

&НаСервере
Процедура ОбновитьВидимостьПоказателейПИФ()
	
	Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		Возврат;
	КонецЕсли;
	
	ВидДоговораДУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	ЭтаФорма.ЭтоПИФ = (ВидДоговораДУ = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда);

	Элементы.ГруппаПИФ.Видимость = ЭтаФорма.ЭтоПИФ;
	Элементы.ФормаПоказатьРасчетРезервов.Видимость = ЭтаФорма.ЭтоПИФ;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриИзмененииРеквизитовШапки()

	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) И ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Этаформа.ВидУчета = РаботаСПереоценкой.ОпределитьВидУчета(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ЦельРасчетаСтоимостиОценки, Объект.Дата);
		
		ЕстьДанные = ДокументСодержитДанные();
		ТекстВопроса = ?(ЕстьДанные, "Перезаполнить документ?" + Символы.ПС + "Внимание! Все внесенные изменения будут утеряны.", "Заполнить документ?");
				
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да И ЗаполнитьАдресФайлаXML() Тогда
			ОчиститьТаблицы();
			ЗаполнитьНаСервере();
		Иначе
			// Если документ пустой, не нужно ничего пересчитывать
			Если ЕстьДанные Тогда
				ЗаполнитьИтогиНаСервере(Истина);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиНаСервере(ИзменитьДанныеДокумента = Ложь, ПересчитатьРезервы = Истина)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	РеквизитыСчетаДУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	
	Если ИзменитьДанныеДокумента И РеквизитыСчетаДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
	
		ПараметрыЗаполнения = Новый Структура("АдресТаблицыСтоимостей");
		Отказ = Ложь;
		Если ПересчитатьРезервы Тогда
			РассчитатьРезервыПИФНаСервере();
		КонецЕсли; 
		ДокументОбъект.ПолучитьПараметрыЗаполнения(ПараметрыЗаполнения, РеквизитыСчетаДУ, Отказ);
		ДокументОбъект.ДополнительныеСвойства.Вставить("НачислениеРезервовПИФ", ЭтаФорма.НачислениеРезервовПИФ);
		ДокументОбъект.ПерезаполнитьЗадолженностьПоРезервам(ПараметрыЗаполнения);
		
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	КонецЕсли; 
	
	ЗначенияИтоговыхРеквизитов = ДокументОбъект.ПолучитьЗначенияИтоговыхРеквизитов(ЭтаФорма.РегистрацияСтоимости.СтоимостиПереоценки.Выгрузить());
	
	Если ЗначенияИтоговыхРеквизитов <> Неопределено Тогда
		
		Если ИзменитьДанныеДокумента Тогда
			Объект.СЧАРынок			= ЗначенияИтоговыхРеквизитов.СЧАРынок;
			Объект.РСА				= ЗначенияИтоговыхРеквизитов.РСА;
			Объект.СтоимостьПая		= ЗначенияИтоговыхРеквизитов.СтоимостьПая;
		КонецЕсли;
		
		ЭтаФорма.КоличествоПаев	= ЗначенияИтоговыхРеквизитов.КоличествоПаев;
		
		ЭтаФорма.ИтогоЦенныеБумаги =
			ЭтаФорма.РегистрацияСтоимости.СтоимостиПереоценки.Итог("СуммаВВалютеУчета")
			+ ЭтаФорма.РегистрацияСтоимости.СтоимостиПереоценки.Итог("СуммаКупонаВВалютеУчета");
		
	КонецЕсли;
		
	#Область Настройка_колонок_таблицы_ЦенныеБумаги
	
	КолонкиСИзменяемойРазрядностью = Новый Структура;
	КолонкиСИзменяемойРазрядностью.Вставить("Количество", 			Новый Структура("Длина, Разрядность", 0, 0));
	КолонкиСИзменяемойРазрядностью.Вставить("ЦенаКотировки", 		Новый Структура("Длина, Разрядность", 0, 2));
	КолонкиСИзменяемойРазрядностью.Вставить("Цена", 				Новый Структура("Длина, Разрядность", 0, 2));
	КолонкиСИзменяемойРазрядностью.Вставить("ЦенаКотировкиКупона", 	Новый Структура("Длина, Разрядность", 0, 2));
	КолонкиСИзменяемойРазрядностью.Вставить("ЦенаКупона", 			Новый Структура("Длина, Разрядность", 0, 2));
	КолонкиСИзменяемойРазрядностью.Вставить("Сумма", 				Новый Структура("Длина, Разрядность", 0, 2));
	КолонкиСИзменяемойРазрядностью.Вставить("СуммаКупона", 			Новый Структура("Длина, Разрядность", 0, 2));
	КолонкиСИзменяемойРазрядностью.Вставить("КурсВалютыНоминала", 	Новый Структура("Длина, Разрядность", 0, 4));	
	
	Для каждого СтрокаСтоимостиПереоценки Из ЭтаФорма.РегистрацияСтоимости.СтоимостиПереоценки Цикл
	
		Для каждого Колонка Из КолонкиСИзменяемойРазрядностью Цикл
			
			КоличествоРазрядов = Макс(СтрДлина(Макс(СтрокаСтоимостиПереоценки[Колонка.Ключ], -СтрокаСтоимостиПереоценки[Колонка.Ключ])%1)-2,0);
			Разрядность = Макс(КолонкиСИзменяемойРазрядностью[Колонка.Ключ].Разрядность, КоличествоРазрядов);
			КолонкиСИзменяемойРазрядностью[Колонка.Ключ].Разрядность = Разрядность;
			КолонкиСИзменяемойРазрядностью[Колонка.Ключ].Длина = СтрДлина(Формат(СтрокаСтоимостиПереоценки[Колонка.Ключ], "ЧГ=3,0;ЧДЦ=" + Разрядность)); 
		
		КонецЦикла; 
	
	КонецЦикла;
	
	Для каждого Колонка Из КолонкиСИзменяемойРазрядностью Цикл
		
		Для Счетчик = 1 По 2 Цикл
			
			ИмяЭлемента = "СтоимостиПереоценки" + ?(Счетчик = 1, "Краткий", "") + Колонка.Ключ;
			
			Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
				Элемент = Элементы[ИмяЭлемента];
				ПараметрыЭлемента = Колонка.Значение;
				Элемент.Формат = "ЧДЦ=" + ПараметрыЭлемента.Разрядность;
				Элемент.Ширина = ПараметрыЭлемента.Длина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	#КонецОбласти 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицы()

	Объект.АктивыНеОтносящиесяКЦеннымБумагам.Очистить();
	ЭтаФорма.РегистрацияСтоимости.СтоимостиПереоценки.Очистить();
	ЭтаФорма.РегистрацияСтоимости.СтоимостиПрочихЦенныхБумаг.Очистить();
	
	Если ЭтаФорма.ЭтоПИФ Тогда
		ЭтаФорма.НачислениеРезервовПИФ.СуммаНаВознаграждениеУправляющего = 0;
		ЭтаФорма.НачислениеРезервовПИФ.СуммаНаПрочиеРасходы = 0;
		ЭтаФорма.НачислениеРезервовПИФ.СуммаНаУслугиДепозитария = 0;
	КонецЕсли; 
	
КонецПроцедуры // ОчиститьТаблицы()

&НаКлиенте
Процедура ВопросПередЗаполнениемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры //ВопросПередЗаполнениемЗавершение 

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Если Параметры.Свойство("ЗначениеКопирования") И Не Параметры.ЗначениеКопирования.Пустая() Тогда
		
		Объект.РучнойВвод = Истина;
		Объект.РегистрацияСтоимости = Неопределено;
		Объект.НачислениеРезервовПИФ = Неопределено;
		
		Если Не Параметры.ЗначениеКопирования.РегистрацияСтоимости.Пустая() Тогда
			ЗначениеВРеквизитФормы(Параметры.ЗначениеКопирования.РегистрацияСтоимости.Скопировать(), "РегистрацияСтоимости");
		КонецЕсли; 
		Если Не Параметры.ЗначениеКопирования.НачислениеРезервовПИФ.Пустая() Тогда
			ЗначениеВРеквизитФормы(Параметры.ЗначениеКопирования.НачислениеРезервовПИФ.Скопировать(), "НачислениеРезервовПИФ");
		КонецЕсли; 
		Если Не Параметры.ЗначениеКопирования.НачислениеСписаниеРезервов.Пустая() Тогда
			ЗначениеВРеквизитФормы(Параметры.ЗначениеКопирования.НачислениеСписаниеРезервов.Скопировать(), "НачислениеСписаниеРезервов");
		КонецЕсли; 
		
		Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(ТекущаяДата(), Объект.Ссылка);
		
	ИначеЕсли Объект.Ссылка.Пустая() Тогда	
		
		Объект.ЦельРасчетаСтоимостиОценки = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
		Объект.РучнойВвод = Истина;
		
		Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(ТекущаяДата(), Объект.Ссылка);
		
	КонецЕсли; 
	
	ПредставлениеВалюты = "(" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета") + ")";
	Элементы.СтоимостиПереоценкиСуммаВВалютеУчета.Заголовок 						= "Сумма " + ПредставлениеВалюты;
	Элементы.СтоимостиПереоценкиСуммаКупонаВВалютеУчета.Заголовок 					= "Сумма купона " + ПредставлениеВалюты;
	Элементы.СтоимостиПереоценкиСуммаВсего.Заголовок 								= "Всего " + ПредставлениеВалюты;
	Элементы.СтоимостиПереоценкиКраткийСуммаВВалютеУчета.Заголовок 					= "Сумма " + ПредставлениеВалюты;
	Элементы.СтоимостиПереоценкиКраткийСуммаКупонаВВалютеУчета.Заголовок 			= "Сумма купона " + ПредставлениеВалюты;
	Элементы.СтоимостиПереоценкиКраткийСуммаВсего.Заголовок 						= "Всего " + ПредставлениеВалюты;
	Элементы.АктивыНеОтносящиесяКЦеннымБумагамСуммаРынокВВалютеУчета.Заголовок 		= "Сумма " + ПредставлениеВалюты + " с учетом резерва";
	Элементы.АктивыНеОтносящиесяКЦеннымБумагамСуммаРезерваВВалютеУчета.Заголовок	= "Сумма резерва " + ПредставлениеВалюты;

	ЭтаФорма.ВидУчета = РаботаСПереоценкой.ОпределитьВидУчета(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ЦельРасчетаСтоимостиОценки, Объект.Дата);
	
	Если Не Объект.РегистрацияСтоимости.Пустая() Тогда
		ЗначениеВРеквизитФормы(Объект.РегистрацияСтоимости.ПолучитьОбъект(), "РегистрацияСтоимости");
	КонецЕсли; 	
	
	Если Не Объект.НачислениеРезервовПИФ.Пустая() Тогда
		ЗначениеВРеквизитФормы(Объект.НачислениеРезервовПИФ.ПолучитьОбъект(), "НачислениеРезервовПИФ");
	КонецЕсли; 	
	
	Если Не Объект.НачислениеСписаниеРезервов.Пустая() Тогда
		ЗначениеВРеквизитФормы(Объект.НачислениеСписаниеРезервов.ПолучитьОбъект(), "НачислениеСписаниеРезервов");
	КонецЕсли; 	
	
	ЗаполнитьИтогиНаСервере();
	
	ОбновитьВидимостьПоказателейПИФ();
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуВВалютеУчетаТекущейСтрокиАктивовНеОтносящихсяКЦеннымБумагам() 
	
	СтрокаДокумента = Элементы.АктивыНеОтносящиесяКЦеннымБумагам.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаДокумента.ВалютаСтроки) Тогда
		СуммаРынокВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаДокумента.СуммаРынок, СтрокаДокумента.ВалютаСтроки, Объект.Организация, Объект.Дата);
	Иначе
		СуммаРынокВВалютеУчета = 0;		
	КонецЕсли;
		
	СтрокаДокумента.СуммаРынокВВалютеУчета = Окр(СуммаРынокВВалютеУчета, 2) + СтрокаДокумента.СуммаРезерваВВалютеУчета;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуВВалютеАктиваТекущейСтрокиАктивовНеОтносящихсяКЦеннымБумагам()
	
	СтрокаДокумента = Элементы.АктивыНеОтносящиесяКЦеннымБумагам.ТекущиеДанные;
	
	ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета");
	Если ЗначениеЗаполнено(СтрокаДокумента.ВалютаСтроки) Тогда
		СуммаРынок = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаДокумента.СуммаРынокВВалютеУчета - СтрокаДокумента.СуммаРезерваВВалютеУчета, ВалютаУчета, Объект.Дата, СтрокаДокумента.ВалютаСтроки, Объект.Дата);
	Иначе
		СуммаРынок = 0;		
	КонецЕсли;
		
	СтрокаДокумента.СуммаРынок = Окр(СуммаРынок, 2);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьАдресФайлаXML()

	НастройкиОценки	= РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ЦельРасчетаСтоимостиОценки);
	АдресФайлаXML	= Неопределено;
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + Объект.ЦельРасчетаСтоимостиОценки + "'");
		
		Возврат Ложь;
		
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом") Тогда
		
		АдресФайлаXML = РаботаСВнешнимиСистемамиКлиентСервер.ВыбратьФайлОценочнойСтоимостиПредоставленнойКлиентом(
			Объект.СчетДоверительногоУправления, Объект.Дата, Ложь, ЭтаФорма.УникальныйИдентификатор);
			
		Если ЭтоАдресВременногоХранилища(АдресФайлаXML) Тогда
			
			Возврат Истина;
			
		Иначе
			
			РезультатВопроса = Вопрос("Файл с оценочной стоимостью не выбран." + Символы.ПС + "Продолжить заполнение?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			
			Возврат (РезультатВопроса = КодВозвратаДиалога.Да)
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("АдресТаблицыСтоимостей", 			АдресФайлаXML);
	
	ДокументНаСервере = РеквизитФормыВЗначение("Объект");
	
	ДокументНаСервере.ДополнительныеСвойства.Вставить("РегистрацияСтоимости", РеквизитФормыВЗначение("РегистрацияСтоимости"));
	ДокументНаСервере.ДополнительныеСвойства.Вставить("НачислениеСписаниеРезервов", РеквизитФормыВЗначение("НачислениеСписаниеРезервов"));
	ДокументНаСервере.ДополнительныеСвойства.Вставить("НачислениеРезервовПИФ", РеквизитФормыВЗначение("НачислениеРезервовПИФ"));
	
	Отказ = Ложь;
	ДокументНаСервере.ЗаполнитьДокументыРегистрацииСтоимости(ПараметрыЗаполнения, Ложь, Отказ);
	ДокументНаСервере.РучнойВвод = Отказ;
	
	ЗначениеВРеквизитФормы(ДокументНаСервере.ДополнительныеСвойства.НачислениеСписаниеРезервов, "НачислениеСписаниеРезервов");
	
	ЗначениеВРеквизитФормы(ДокументНаСервере.ДополнительныеСвойства.РегистрацияСтоимости, "РегистрацияСтоимости");
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	
	ЗначениеВРеквизитФормы(ДокументНаСервере.ДополнительныеСвойства.НачислениеРезервовПИФ, "НачислениеРезервовПИФ");
	
	УстановитьДоступностьЭлементов = (Объект.РучнойВвод <> ДокументНаСервере.РучнойВвод);
	
	ЗначениеВРеквизитФормы(ДокументНаСервере, "Объект");
	
	ЗаполнитьИтогиНаСервере(Ложь);
	
	Если УстановитьДоступностьЭлементов Тогда
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли; 
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокФинансовыхПоказателей(Регистратор, МассивПоказателейДляКоторыхЕстьРасшифровка) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Регистратор = &Регистратор
		|	И ФинансовыеПоказатели.ВидПоказателя В(&МассивПоказателейДляКоторыхЕстьРасшифровка)";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("МассивПоказателейДляКоторыхЕстьРасшифровка", МассивПоказателейДляКоторыхЕстьРасшифровка);
	
	СписокФинансовыхПоказателей = Новый СписокЗначений;
	СписокФинансовыхПоказателей.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидПоказателя"));
	
	Возврат СписокФинансовыхПоказателей;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере(ИмяКорзиныЦенныхБумаг = Неопределено, ИдСтрокиКорзины = Неопределено)
	
	Если ЗначениеЗаполнено(ИмяКорзиныЦенныхБумаг) Тогда
	
		ИндексСтрокиКорзины = ?(ИдСтрокиКорзины = Неопределено, Неопределено,
			ЭтаФорма.РегистрацияСтоимости[ИмяКорзиныЦенныхБумаг].Индекс(ЭтаФорма.РегистрацияСтоимости[ИмяКорзиныЦенныхБумаг].НайтиПоИдентификатору(ИдСтрокиКорзины)));
		
		РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьНоминалыЦенныхБумагИСуммыВсего(ЭтаФорма, ЭтаФорма.РегистрацияСтоимости, ИмяКорзиныЦенныхБумаг, ИндексСтрокиКорзины);
		
	Иначе
		
		РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьНоминалыЦенныхБумагИСуммыВсего(ЭтаФорма, ЭтаФорма.РегистрацияСтоимости, "СтоимостиПереоценки");
		
		РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьНоминалыЦенныхБумагИСуммыВсего(ЭтаФорма, ЭтаФорма.РегистрацияСтоимости, "СтоимостиПрочихЦенныхБумаг");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСтрокиТаблицы(ИмяТаблицы)

	Если Не (Элементы[ИмяТаблицы].ТолькоПросмотр Или ЭтаФорма.ТолькоПросмотр) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущаяКолонка = Элементы[ИмяТаблицы].ТекущийЭлемент; 
	ИмяКолонки = СтрЗаменить(ТекущаяКолонка.Имя, ИмяТаблицы, "");
	
	// Требуются значения только отдельных колонок
	Если Не (ИмяКолонки = "Партия" Или ИмяКолонки = "ЦеннаяБумага" Или ИмяКолонки = "СубъектАналитики"  Или ИмяКолонки = "Основание") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные[ИмяКолонки]) Тогда
		ОткрытьЗначение(ТекущиеДанные[ИмяКолонки]);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРынка(ИмяТаблицы)

	Если ИмяТаблицы = "СтоимостиПереоценки" Тогда
		ИмяТаблицы = "СтоимостиПереоценки" + ?(ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг, "", "Краткий");
	КонецЕсли; 
	
	ТекСтрока = Элементы[ИмяТаблицы].ТекущиеДанные;
	Элементы[ИмяТаблицы + "ЦеннаяБумага"].ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ТекСтрока.Рынок);

КонецПроцедуры

&НаКлиенте
Процедура ПересчетТабличнойЧасти(Элемент, ИзмененныйРеквизит)
	
	// Определим таблицу формы по элементу
	
	ТаблицаФормы = Элемент;
	Пока ТипЗнч(ТаблицаФормы) <> Тип("ТаблицаФормы") Цикл
		ТаблицаФормы = ТаблицаФормы.Родитель;
	КонецЦикла;
	
	// Пересчитаем нужные поля
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма, ТаблицаФормы.Имя, ИзмененныйРеквизит, , Истина, "");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)

	ТолькоПросмотр = Не Форма.Объект.РучнойВвод;
	
	МассивЭлементов = Новый Массив;
	
	МассивЭлементов.Добавить("Номер");
	МассивЭлементов.Добавить("Дата");
	МассивЭлементов.Добавить("СчетДоверительногоУправления");
	МассивЭлементов.Добавить("СтоимостиПереоценки");
	МассивЭлементов.Добавить("СтоимостиПереоценкиКраткий");
	МассивЭлементов.Добавить("АктивыНеОтносящиесяКЦеннымБумагам");
	МассивЭлементов.Добавить("ПрочиеЦенныеБумаги");
	
	МассивЭлементов.Добавить("НачислениеРезервовСуммаНаВознаграждениеУправляющего");
	МассивЭлементов.Добавить("НачислениеРезервовСуммаНаУслугиДепозитария");
	МассивЭлементов.Добавить("НачислениеРезервовСуммаНаПрочиеРасходы");
	МассивЭлементов.Добавить("КомандаРассчитатьРезервы");
	
	Для каждого ИмяЭлемента Из МассивЭлементов Цикл
		Элемент = Форма.Элементы[ИмяЭлемента];
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
			Элемент.Доступность = Не ТолькоПросмотр;
		Иначе
			Элемент.ТолькоПросмотр = ТолькоПросмотр;
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Функция КонтрольСЧАНаСервере()

	СтоимостиАктивов = Объект.АктивыНеОтносящиесяКЦеннымБумагам.Выгрузить();
	СтоимостиАктивов.Свернуть("ВидАктива, СубъектАналитики, Контрагент, Основание, ВидЗадолженности, ВалютаСтроки", "СуммаРынокВВалютеУчета, СуммаРезерваВВалютеУчета");
	
	РеквизитыКонтроля = Новый Структура;
	РеквизитыКонтроля.Вставить("Период", 						НачалоДня(Объект.Дата));
	РеквизитыКонтроля.Вставить("СтоимостиПереоценки", 			РегистрацияСтоимости.СтоимостиПереоценки.Выгрузить());
	РеквизитыКонтроля.Вставить("СтоимостиПрочихЦенныхБумаг", 	РегистрацияСтоимости.СтоимостиПрочихЦенныхБумаг.Выгрузить());
	РеквизитыКонтроля.Вставить("СтоимостиАктивов", 				СтоимостиАктивов);
	
	ФинансовыеПоказатели = Новый ТаблицаЗначений;
	ФинансовыеПоказатели.Колонки.Добавить("ВидПоказателя", 	Метаданные.РегистрыСведений.ФинансовыеПоказатели.Измерения.ВидПоказателя.Тип);
	ФинансовыеПоказатели.Колонки.Добавить("Значение", 		Метаданные.РегистрыСведений.ФинансовыеПоказатели.Ресурсы.Значение.Тип);
	ФинансовыеПоказатели.Колонки.Добавить("РучнойВвод",		Новый ОписаниеТипов("Булево"));
	
	НоваяСтрока = ФинансовыеПоказатели.Добавить();
	НоваяСтрока.ВидПоказателя 	= Справочники.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок;
	НоваяСтрока.Значение 		= Объект.СЧАРынок;
	НоваяСтрока.РучнойВвод 		= Объект.РучнойВвод;
	
	НоваяСтрока = ФинансовыеПоказатели.Добавить();
	НоваяСтрока.ВидПоказателя 	= Справочники.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов;
	НоваяСтрока.Значение 		= Объект.РСА;
	НоваяСтрока.РучнойВвод 		= Объект.РучнойВвод;
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	Если ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
		НоваяСтрока = ФинансовыеПоказатели.Добавить();
		НоваяСтрока.ВидПоказателя 	= Справочники.ВидыФинансовыхПоказателей.СтоимостьПая;
		НоваяСтрока.Значение 		= Объект.СтоимостьПая;
		НоваяСтрока.РучнойВвод 		= Объект.РучнойВвод;
	КонецЕсли; 
	
	РеквизитыКонтроля.Вставить("ФинансовыеПоказатели", ФинансовыеПоказатели);
	
	ПараметрыКонтроля = Новый Структура("Период, Организация, СчетДоверительногоУправления, РеквизитыКонтроля", 
		РеквизитыКонтроля.Период, 
		Объект.Организация,
		Объект.СчетДоверительногоУправления,
		РеквизитыКонтроля);
	
	НаборыДанных = Обработки.КонтрольСЧА.ВыполнитьПроверку(ПараметрыКонтроля);
	
	Если ТипЗнч(НаборыДанных) = Тип("Структура") Тогда
		Если НаборыДанных.Свойство("ТекстОшибки") Тогда
			Возврат НаборыДанных.ТекстОшибки;
		Иначе 
			Возврат Обработки.КонтрольСЧА.СформироватьТабличныйДокумент(НаборыДанных);
		КонецЕсли; 
	КонецЕсли; 

КонецФункции

&НаКлиенте
Процедура УстановитьРежимОтображенияТаблицыЦенныхБумаг()

	ЗаголовокПодменю = "Режим отображения (" + ?(ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг, "полный)", "краткий)");
	
	Для Счетчик = 1 По 2 Цикл
	
		Элементы["СтоимостиПереоценкиКомандаРежимОтображенияПолный" + Счетчик].Пометка = ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг;
		Элементы["СтоимостиПереоценкиКомандаРежимОтображенияКраткий" + Счетчик].Пометка = Не ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг;
		
		Элементы["СтоимостиПереоценкиРежимОтображения" + Счетчик].Заголовок = ЗаголовокПодменю;
	
	КонецЦикла; 
	
	Если ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг Тогда
		Элементы.СтоимостиПереоценки.ТекущаяСтрока = Элементы.СтоимостиПереоценкиКраткий.ТекущаяСтрока;
	Иначе
		Элементы.СтоимостиПереоценкиКраткий.ТекущаяСтрока = Элементы.СтоимостиПереоценки.ТекущаяСтрока;
	КонецЕсли; 
	
	Элементы.СтоимостиПереоценки.Видимость = ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг;
	Элементы.СтоимостиПереоценкиКраткий.Видимость = Не ЭтаФорма.ПолныйРежимОтображенияТаблицыЦенныхБумаг;
	
КонецПроцедуры

&НаСервере
Процедура КомандаПоказатьРасчетРезервовНаСервере(РасшифровкаРасчета)
	
	ОбъектРасчета = ПолучитьОбъектРасчетаРезервов();
	ОбъектРасчета.Вставить("РасшифровкаРасчета", Новый Структура);
	
	Документы.НачислениеРезервовПИФ.РассчитатьРезервы(ОбъектРасчета);
	
	Если ОбъектРасчета.РасшифровкаРасчета.Свойство("Расшифровка") Тогда
						
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("Расшифровка расчета резервов " + Объект.СчетДоверительногоУправления,,, РасшифровкаРасчета);
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, ОбъектРасчета.РасшифровкаРасчета.Расшифровка);    
		РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыВывода);
		
		МассивРезервов = Новый Массив;
		МассивРезервов.Добавить("ЗаВознаграждениеУправляющего");
		МассивРезервов.Добавить("ЗаВознаграждениеДепозитария");
		МассивРезервов.Добавить("ЗаПрочиеВозмещаемыеРасходыУправляющего"); 
		
		Макет = РеквизитФормыВЗначение("НачислениеРезервовПИФ").ПолучитьМакет("Формулы");
		
		// Добавляем формулы
		Для Каждого Резерв Из МассивРезервов Цикл
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовок.Параметры.Заголовок = ?(Резерв = "ЗаВознаграждениеУправляющего", "Резерв на вознаграждение управляющего",
					?(Резерв = "ЗаВознаграждениеДепозитария", "Резерв на вознаграждение депозитария, аудитора, оценщика", "Резерв на прочие возмещаемые расходы управляющего"));
					
			РасшифровкаРасчета.Вывести(ОбластьЗаголовок);
			
			РасшифровкаРасчета.НачатьГруппуСтрок();
			
			РасшифровкаРасчета.Вывести(Макет.ПолучитьОбласть("ПустаяСтрока"));
			
			Если ОбъектРасчета.РасшифровкаРасчета.Свойство(Резерв + "ФормулыПоСЧА") Тогда				
				ДобавитьФормулыВТабличныйДокументНаСервере(РасшифровкаРасчета, ОбъектРасчета.РасшифровкаРасчета[Резерв + "ФормулыПоСЧА"], Макет);
			КонецЕсли;
			
			Если ОбъектРасчета.РасшифровкаРасчета.Свойство(Резерв + "ФормулыПоСреднегодовой") Тогда				
				ДобавитьФормулыВТабличныйДокументНаСервере(РасшифровкаРасчета, ОбъектРасчета.РасшифровкаРасчета[Резерв + "ФормулыПоСреднегодовой"], Макет);
			КонецЕсли;
			
			Если ОбъектРасчета.РасшифровкаРасчета.Свойство(Резерв + "ФормулыФиксированнойСуммой") Тогда				
				ДобавитьФормулыВТабличныйДокументНаСервере(РасшифровкаРасчета, ОбъектРасчета.РасшифровкаРасчета[Резерв + "ФормулыФиксированнойСуммой"], Макет);
			КонецЕсли;
			
			РасшифровкаРасчета.ЗакончитьГруппуСтрок();  
	
			РасшифровкаРасчета.Вывести(Макет.ПолучитьОбласть("ПустаяСтрока"));
	
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектРасчетаРезервов()

	ОбъектРасчета = Новый Структура("Ссылка, Дата, Организация, СчетДоверительногоУПравления, СуммаНаВознаграждениеУправляющего, СуммаНаУслугиДепозитария, СуммаНаПрочиеРасходы"); 
	ЗаполнитьЗначенияСвойств(ОбъектРасчета, Объект, "Дата, Организация, СчетДоверительногоУПравления");
	ОбъектРасчета.Вставить("ПаевойИнвестиционныйФонд", 			Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата));
	ОбъектРасчета.Вставить("СтоимостиПереоценки", 				ЭтаФорма.РегистрацияСтоимости.СтоимостиПереоценки.Выгрузить());
	ОбъектРасчета.Вставить("АктивыНеОтносящиесяКЦеннымБумагам", Объект.АктивыНеОтносящиесяКЦеннымБумагам.Выгрузить());
	
	Возврат ОбъектРасчета;

КонецФункции

&НаСервере
Процедура ДобавитьФормулыВТабличныйДокументНаСервере(РасшифровкаРасчета, ПараметрыФормул, Макет)
		
	ОбластьФормулы = Макет.ПолучитьОбласть(ПараметрыФормул.ИмяОбластиФормулВМакете);
	ОбластьФормулы.Параметры.Заполнить(ПараметрыФормул);
	
	РасшифровкаРасчета.Вывести(ОбластьФормулы);	
		
КонецПроцедуры

&НаСервере
Процедура РассчитатьРезервыПИФНаСервере()
	
	Резервы = Документы.НачислениеРезервовПИФ.РассчитатьРезервы(ПолучитьОбъектРасчетаРезервов());
	Если Резервы = Неопределено Тогда
		ЭтаФорма.НачислениеРезервовПИФ.СуммаНаВознаграждениеУправляющего = 0;
		ЭтаФорма.НачислениеРезервовПИФ.СуммаНаПрочиеРасходы = 0;
		ЭтаФорма.НачислениеРезервовПИФ.СуммаНаУслугиДепозитария = 0;
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтаФорма.НачислениеРезервовПИФ, Резервы);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
